# Data Management:

- using ```df.sample()``` and ```df.copy()``` methods

### 1. ``` df.sample()```

In [1]:
# import libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# load dataset
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()  

# data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [ ]:
# returns different samples on every run, output varies all the time
df.sample(10)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
722811,Data Engineer,Clinical Data Engineer II,"Taipei, Taiwan",via Trabajo.org,Full-time,False,Taiwan,2023-03-25 21:19:33,False,False,Taiwan,None,NaN,NaN,Parexel,"['sas', 'sas']","{'analyst_tools': ['sas'], 'programming': ['sa..."
467893,Data Analyst,Data Analyst $28 HAYWARD,"Hayward, CA",via SimplyHired,Full-time,False,"California, United States",2023-10-30 14:00:18,True,True,United States,None,NaN,NaN,Human Bees,['excel'],{'analyst_tools': ['excel']}
305619,Data Engineer,"Data Engineer, LMR Data Foundations","Ontario, Canada",via LinkedIn,Full-time,False,Canada,2023-07-21 17:14:46,False,False,Canada,None,NaN,NaN,BioTalent Canada,"['sql', 'r', 'databricks', 'aws', 'azure', 'gc...","{'analyst_tools': ['tableau'], 'async': ['jira..."
705638,Data Analyst,Data Analyst,"Weilburg, Germany",via BeBee,Full-time,False,Germany,2023-09-26 03:35:46,True,False,Germany,None,NaN,NaN,FEIG ELECTRONIC GmbH,None,None
544054,Data Scientist,Entry Level Data Scientist,"Pasadena, CA",via California Jobs - Tarta.aiðŸŒ´,Full-time,False,"California, United States",2023-03-07 19:26:47,False,False,United States,None,NaN,NaN,SynergisticIT,"['python', 'numpy', 'seaborn', 'plotly', 'tens...","{'analyst_tools': ['tableau', 'excel'], 'libra..."
469517,Data Engineer,Data Engineer,"Stockholm, Sweden",via LinkedIn,Full-time,False,Sweden,2023-01-30 14:31:12,True,False,Sweden,None,NaN,NaN,Computer Futures,['sql'],{'programming': ['sql']}
612346,Data Analyst,Senior Pricing Data Analyst,"Corona, CA",via Jobs Trabajo.org,Full-time,False,"California, United States",2023-08-22 12:01:40,False,True,United States,None,NaN,NaN,ZT Systems,"['python', 'go', 'pandas', 'numpy', 'tableau',...","{'analyst_tools': ['tableau', 'excel'], 'async..."
527787,Software Engineer,Senior Software Engineer,"PoznaÅ„, Poland",via Trabajo.org,Full-time,False,Poland,2023-04-19 11:25:13,True,False,Poland,None,NaN,NaN,Egnyte,"['c++', 'windows', 'git', 'github']","{'os': ['windows'], 'other': ['git', 'github']..."
153732,Data Scientist,AI/ML Data Scientist,"Gainesville, FL",via BeBee,Full-time,False,"Florida, United States",2023-03-12 08:07:30,False,True,United States,None,NaN,NaN,University of Florida,"['python', 'sql', 'aws', 'pandas', 'pytorch', ...","{'analyst_tools': ['excel'], 'cloud': ['aws'],..."
720820,Machine Learning Engineer,Machine Learning Engineer,Denmark,via BeBee,Full-time,False,Denmark,2023-01-11 21:38:29,False,False,Denmark,None,NaN,NaN,Sotrender,"['python', 'nosql', 'mongodb', 'mongodb', 'dyn...","{'cloud': ['gcp'], 'databases': ['mongodb', 'd..."

In [11]:
# random state fixes randomness, get the same result everytime you run the code
df.sample(10, random_state=42)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
502901,Senior Data Engineer,Senior Data Engineer,"St Paul, MN",via BeBee,Full-time,False,"Florida, United States",2023-12-17 11:09:06,False,False,United States,None,NaN,NaN,ManpowerGroup,"['sql', 'azure', 'git']","{'cloud': ['azure'], 'other': ['git'], 'progra..."
406337,Senior Data Scientist,Senior Analytics Engineer,"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-10-06 16:09:56,False,False,United Kingdom,None,NaN,NaN,Harnham,"['sql', 'python', 'bigquery', 'snowflake', 'lo...","{'analyst_tools': ['looker'], 'cloud': ['bigqu..."
659951,Data Engineer,Data Engineer,"Newcastle upon Tyne, UK",via Indeed,Full-time,False,United Kingdom,2023-09-06 10:11:25,True,False,United Kingdom,None,NaN,NaN,Morgan King,None,None
541593,Data Analyst,Data Analyst,Malta,via Trabajo.org,Full-time,False,Malta,2023-02-14 21:14:18,True,False,Malta,None,NaN,NaN,Konnekt,['jira'],{'async': ['jira']}
425158,Senior Data Engineer,Senior Data Engineer. Job in Amsterdam NBC4i Jobs,"Amsterdam, Netherlands",via NBC4i Jobs,Full-time,False,Netherlands,2023-06-19 16:34:30,True,False,Netherlands,None,NaN,NaN,Independent Recruiters,['python'],{'programming': ['python']}
183426,Data Analyst,Data Analyst,Singapore,via Singapore | JobsDB,Full-time,False,Singapore,2023-11-09 16:07:57,False,False,Singapore,None,NaN,NaN,FLEXOSENSE PTE. LTD.,"['r', 'python', 'java', 'sql', 'sql server', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
287790,Data Analyst,Data Analyst,"Tampa, FL",via LinkedIn,Full-time,False,"Florida, United States",2023-07-14 17:02:23,True,False,United States,None,NaN,NaN,Iris Software Inc.,"['sql', 'hadoop', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['ha..."
541983,Data Analyst,"Data Analyst, Cloud Systems Jobs","Chantilly, VA",via Clearance Jobs,Full-time,False,Georgia,2023-06-15 19:44:34,False,False,United States,None,NaN,NaN,SAIC,"['sql', 'r', 'matlab', 'python', 'oracle', 'aw...","{'analyst_tools': ['power bi', 'tableau', 'qli..."
416896,Data Scientist,Alternant Actuariat & Data Science H/F,France,via LinkedIn,Full-time,False,France,2023-09-22 16:47:24,False,False,France,None,NaN,NaN,KPMG France,None,None
780907,Data Engineer,"Data Engineer with Fivetran,Qlik Must","Mexico City, CDMX, Mexico",via BeBee MÃ©xico,Full-time,False,Mexico,2023-01-16 06:19:09,False,False,Mexico,None,NaN,NaN,CORUS Consulting,"['oracle', 'snowflake', 'aws', 'azure', 'alter...","{'analyst_tools': ['alteryx'], 'cloud': ['orac..."

### 2. ```df.copy()```
- makes a copy of this object's indices and data

In [13]:
dataset = load_dataset('lukebarousse/data_jobs')
df_original = dataset['train'].to_pandas()

In [14]:
df_original

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee MÃ©xico,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785736,Software Engineer,DevOps Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,None,NaN,NaN,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,CRM Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,NaN,NaN,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,NaN,NaN,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Principal Associate, Data Engineer (Remote-Eli...","Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,None,NaN,NaN,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,NaN,NaN,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

In [16]:
df_altered = df_original
df_altered.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

In [18]:
median_salary = df_altered['salary_year_avg'].median()
median_salary

115000.0

In [20]:
df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)
df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [21]:
df_original.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [27]:
print("Original DF ID: ",id(df_original))
print("Altered DF ID: ", id(df_altered))
print("Are they both the same?: ",id(df_original) == id(df_altered))

Original DF ID:  2632108757968
Altered DF ID:  2632108757968
Are they both the same?:  True

- looking at the above codes, we can find out that when i tried to fill ```df_altered``` with the median values , ```df_original```'s values also got updated without even calling that df
- this can cause issues while working on data, so we can use the ```df.copy()``` method, where this fault wont occur

In [28]:
dataset = load_dataset('lukebarousse/data_jobs')
df_original = dataset['train'].to_pandas()

In [29]:
df_altered = df_original.copy()

In [30]:
print("Original DF ID: ",id(df_original))
print("Altered DF ID: ", id(df_altered))
print("Are they both the same?: ",id(df_original) == id(df_altered))

Original DF ID:  2631573757456
Altered DF ID:  2631642832336
Are they both the same?:  False

In [31]:
median_salary = df_altered['salary_year_avg'].median()
df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)
df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [33]:
df_original.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

- now when i used the ```copy()``` method, the ID's of both DFs are different meaning the original DF remains the same
- i can use this method which trying with work with df without changing it